#include <stdio.h>
#include <stdlib.h>

//引入指针的原因：
//1.指针为函数提供修改变量值的手段（做函数参数）；
//2.指针为C的动态内存分配系统提供支持；
//3.指针为动态数据结构（如链表，队列，二叉树等）提供支持；
//4.指针可以改善某些子程序的效率。

//指针是C语言中的一种特殊的数据类型，只存放地址型数据，即指针变量是C语言中专门存放地址型数据的变量。
//如果一个变量中存放的是另一个变量的地址，则称前一个变量指向后一个变量。

int main()
{
    int a = 10;
    int *x;//类型关键字用于声明指针可以指向哪一种类型的变量，*是指针类型说明符，不是指针运算符
    int *y = &a;//指针的初始化

    x = &a;//指针赋值，指针必须指向某个变量才能使用（即一定要初始化）

    printf("&a = %x\n", &a);
    printf("x = %x\n", x);
    printf("&(*x) = %x\n", &(*x));
    printf("*(&a) = %d\n", *(&a));
    printf("*x = %d\n\n", *x);

    a = *x++;//*与++同优先级，是右结合的，相当于a = *x; x = x + 1;
    printf("&a = %d\n", &a);
    printf("x = %x\n", x);
    printf("a = %d\n", a);
    printf("*x = %d\n\n", *x);
    a = (*x)++;//相当于a = *x; *x = *x + 1;
    printf("&a = %d\n", &a);
    printf("x = %d\n", x);
    printf("a = %d\n", a);
    printf("*x = %d\n", *x);

    return 0;
}
